Tekla Open API Reference for Tekla Structures 2025
ComponentDefinitionTypeEnum Enumeration
 The component definition type tells what kind of a component is in question.
 Namespace: Tekla.Structures
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum ComponentDefinitionTypeEnum
Public Enumeration ComponentDefinitionTypeEnum
Members
Member name | Value | Description
SYSTEM | 0 |  With the type system, component is defined using developer-kit
CUSTOM | -1 |  With the type custom, component is defined as custom component
DOTNET | -100000 |  With the type dotnet, component is defined using .NET plug-in interface
DOTNET_CONNECTION | -200000 |  With the type dotnet_connection, connection is defined using .NET plug-in interface
DOTNET_DRAWING | -300000 |  With the type dotnet_drawing, drawing component is defined using .NET drawing plug-in interface
See Also
Reference
Tekla.Structures Namespace